In [1]:
import pandas as pd

# movie_titles_original.csv is a copy of https://www.kaggle.com/datasets/netflix-inc/netflix-prize-data?select=movie_titles.csv

# ParserWarning will be raised as some titles in movie_titles_original.csv contain commas

df = pd.read_csv('movie_titles_original.csv', header=None, names=['id', 'year', 'title'], engine='python', sep=',', index_col=False, encoding='latin_1')

df

C:\Users\nieht\AppData\Local\Temp\ipykernel_20752\3330155750.py:7: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  df = pd.read_csv('movie_titles_original.csv', header=None, names=['id', 'year', 'title'], engine='python', sep=',', index_col=False, encoding='latin_1')

          id    year                                              title
0          1  2003.0                                    Dinosaur Planet
1          2  2004.0                         Isle of Man TT 2004 Review
2          3  1997.0                                          Character
3          4  1994.0                       Paula Abdul's Get Up & Dance
4          5  2004.0                           The Rise and Fall of ECW
...      ...     ...                                                ...
17765  17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17766  17767  2004.0                  Fidel Castro: American Experience
17767  17768  2000.0                                              Epoch
17768  17769  2003.0                                        The Company
17769  17770  2003.0                                       Alien Hunter

[17770 rows x 3 columns]

In [2]:
print("Number of missing values: ", df['year'].isnull().sum())

Number of missing values:  7

In [3]:
df = pd.read_csv('movie_titles.csv', header=None, names=['id', 'year', 'title'], quotechar='"', engine='python', sep=',', index_col=False, encoding='latin_1')

df

          id  year                                              title
0          1  2003                                    Dinosaur Planet
1          2  2004                         Isle of Man TT 2004 Review
2          3  1997                                          Character
3          4  1994                       Paula Abdul's Get Up & Dance
4          5  2004                           The Rise and Fall of ECW
...      ...   ...                                                ...
17765  17766  2002  Where the Wild Things Are and Other Maurice Se...
17766  17767  2004                  Fidel Castro: American Experience
17767  17768  2000                                              Epoch
17768  17769  2003                                        The Company
17769  17770  2003                                       Alien Hunter

[17770 rows x 3 columns]

In [4]:
print("Number of missing values: ", df['year'].isnull().sum())

Number of missing values:  0

In [5]:
print("Number of numerical values: ", (df['year'] < 3000).sum())

Number of numerical values:  17770